Repository: mineo78/backend
Catalog: GamingPlatform/Resources/SharedResource.*.resx
Languages: es_es, fr_fr

# Nav.Home
source: Home
es_es: Inicio
fr_fr: Accueil

# Nav.Lobbies
source: Lobbies
es_es: Salas
fr_fr: Lobbys

# Nav.Scores
source: Scores
es_es: Puntuaciones

# Nav.Puissance4
source: Connect Four
es_es: Conecta 4
fr_fr: Puissance 4

# Nav.Morpion
source: Tic-Tac-Toe
es_es: Tres en raya
fr_fr: Morpion

# Nav.Language
source: Language
es_es: Idioma
fr_fr: Langue

# Common.Play
source: Play
es_es: Jugar
fr_fr: Jouer

# Common.PlayNow
source: Play now
es_es: Jugar ahora
fr_fr: Jouer maintenant

# Common.Create
source: Create
es_es: Crear
fr_fr: Créer

# Common.Lobby
source: Lobby
es_es: Sala

# Common.Join
source: Join
es_es: Unirse
fr_fr: Rejoindre

# Home.HeroSubtitle
source: Discover our interactive games and challenge your friends in real time!
es_es: Descubre nuestros juegos interactivos y reta a tus amigos en tiempo real.
fr_fr: Découvrez nos jeux interactifs et défiez vos amis en temps réel !

# Home.GamesTitle
source: Available Games
es_es: Juegos disponibles
fr_fr: Nos Jeux Disponibles

# Game.Puissance4.Title
source: Connect Four
es_es: Conecta 4
fr_fr: Puissance 4

# Game.Puissance4.Desc
source: Be the first to connect four tokens to win!
es_es: Sé el primero en conectar cuatro fichas para ganar.
fr_fr: Soyez le premier à aligner quatre jetons pour remporter la victoire !

# Game.SpeedTyping.Desc
source: Test your typing speed and accuracy against the clock.
es_es: Pon a prueba tu velocidad y precisión de escritura contra el reloj.
fr_fr: Testez votre vitesse de frappe et votre précision face au chrono.

# Game.Morpion.Title
source: Tic-Tac-Toe
es_es: Tres en raya
fr_fr: Morpion

# Game.Morpion.Desc
source: The timeless classic. Align three symbols before your opponent.
es_es: El clásico de siempre. Alinea tres símbolos antes que tu rival.
fr_fr: Le classique indémodable. Alignez trois symboles avant l'adversaire.

# Lobby.Subtitle
source: Join a game or create your own!
es_es: Únete a una partida o crea la tuya.
fr_fr: Rejoignez une partie ou créez la vôtre !

# Lobby.CreateGame
source: Create a game
es_es: Crear una partida
fr_fr: Créer une partie

# Lobby.GameNameLabel
source: Game name
es_es: Nombre de la partida
fr_fr: Nom de la partie

# Lobby.GameNamePlaceholderExample
source: e.g. Quick match
es_es: Ej.: Partida rápida
fr_fr: Ex: Partie rapide

# Lobby.YourNicknameLabel
source: Your nickname
es_es: Tu apodo
fr_fr: Votre pseudo

# Lobby.YourNicknamePlaceholder
source: Enter your nickname
es_es: Introduce tu apodo
fr_fr: Entrez votre pseudo

# Lobby.AvailableGames
source: Available games
es_es: Partidas disponibles
fr_fr: Parties disponibles

# Lobby.NoGames
source: No games yet. Be the first to create one!
es_es: Aún no hay partidas. ¡Sé el primero en crear una!
fr_fr: Aucune partie pour le moment. Soyez le premier à en créer une !

# Lobby.Host
source: Host
es_es: Anfitrión
fr_fr: Hôte

# Lobby.Players
source: Players
es_es: Jugadores
fr_fr: Joueurs

# Lobby.NicknamePlaceholder
source: Nickname
es_es: Apodo
fr_fr: Pseudo

# Common.Status
source: Status
es_es: Estado
fr_fr: Statut

# Common.Connecting
source: Connecting...
es_es: Conectando...
fr_fr: Connexion...

# Common.Close
source: Close
es_es: Cerrar
fr_fr: Fermer

# Morpion.Game.PlayerLabel
source: Player
es_es: Jugador
fr_fr: Joueur

# Morpion.Game.Connected
source: Connected to Tic-Tac-Toe server
es_es: Conectado al servidor de Tres en raya
fr_fr: Connecté au serveur Morpion

# Morpion.Game.WaitingOpponent
source: Waiting for the opponent...
es_es: Esperando al oponente...
fr_fr: En attente de l'adversaire...

# Morpion.Game.GameStartsTurn
source: The game is starting! It's {0}'s turn
es_es: ¡Empieza la partida! Turno de {0}
fr_fr: La partie commence ! C'est au tour de {0}

# Morpion.Game.TurnOf
source: It's {0}'s turn
es_es: Turno de {0}
fr_fr: C'est au tour de {0}

# Morpion.Game.WinnerIs
source: The winner is {0}!
es_es: ¡El ganador es {0}!
fr_fr: Le gagnant est {0} !

# Morpion.Game.PlayerWon
source: {0} won!
es_es: ¡{0} ha ganado!
fr_fr: {0} a gagné !

# Morpion.Game.Tie
source: It's a tie!
es_es: ¡Empate!
fr_fr: Match nul !

# Morpion.Game.NotYourTurn
source: It's not your turn!
es_es: ¡No es tu turno!
fr_fr: Ce n'est pas votre tour !

# Morpion.Game.InvalidMove
source: Invalid move!
es_es: ¡Movimiento inválido!
fr_fr: Mouvement invalide !

# Room.Title
source: Waiting room: {0}
es_es: Sala de espera: {0}
fr_fr: Salle d'attente: {0}

# Room.Game
source: Game
es_es: Juego
fr_fr: Jeu

# Room.StartGame
source: Start game
es_es: Iniciar partida
fr_fr: Démarrer la partie

# Room.WaitingOthers
source: Waiting for other players...
es_es: Esperando a otros jugadores...
fr_fr: En attente d'autres joueurs...

# Room.WaitingHost
source: Waiting for the host to start the game...
es_es: Esperando a que el anfitrión inicie la partida...
fr_fr: En attente que l'hôte démarre la partie...

# SpeedTyping.Lobbies.Title
source: SpeedTyping Lobby
es_es: Sala SpeedTyping
fr_fr: Lobby SpeedTyping

# SpeedTyping.Lobbies.Subtitle
source: Join an existing lobby or create a new one to start playing.
es_es: Únete a una sala existente o crea una nueva para empezar a jugar.
fr_fr: Rejoignez un lobby existant ou créez-en un nouveau pour commencer à jouer.

# SpeedTyping.Lobbies.Available
source: Available lobbies
es_es: Salas disponibles
fr_fr: Lobbys disponibles

# SpeedTyping.Lobbies.CreateNew
source: Create a new lobby
es_es: Crear una nueva sala
fr_fr: Créer un nouveau lobby

# SpeedTyping.Lobbies.LobbyNameLabel
source: Lobby name:
es_es: Nombre de la sala:
fr_fr: Nom du lobby :

# SpeedTyping.Lobbies.LobbyNamePlaceholder
source: Enter a name
es_es: Introduce un nombre
fr_fr: Entrez un nom

# SpeedTyping.Lobbies.HostLabel
source: Host
es_es: Anfitrión

# SpeedTyping.LegacyLobbies.PageTitle
source: Lobby list
es_es: Lista de salas
fr_fr: Liste des lobbys

# SpeedTyping.GameOver.Title
source: Game over
es_es: Fin de la partida
fr_fr: Fin du jeu

# SpeedTyping.GameOver.BackToLobbies
source: Back to the lobby list
es_es: Volver a la lista de salas
fr_fr: Retour à la liste des salons

# SpeedTyping.GameOver.PodiumTitle
source: Podium:
es_es: Podio:

# SpeedTyping.GameOver.NoPlayers
source: No players participated.
es_es: No ha participado ningún jugador.
fr_fr: Aucun joueur n'a participé.

# SpeedTyping.GameOver.WinnerIs
source: The winner is: {0}!
es_es: El ganador es: {0}!
fr_fr: Le vainqueur est : {0} !

# SpeedTyping.Lobby.WelcomeTitle
source: Welcome to {0}'s lobby
es_es: Bienvenido a la sala de {0}
fr_fr: Bienvenue au Lobby de {0}

# SpeedTyping.Lobby.Subtitle
source: Join the lobby and get ready for an exciting Speed Typing match!
es_es: Únete a la sala y prepárate para una partida emocionante de Speed Typing.
fr_fr: Rejoignez le lobby et préparez-vous à une partie de Speed Typing excitante !

# SpeedTyping.Lobby.PlayersTitle
source: Player list:
es_es: Lista de jugadores:
fr_fr: Liste des joueurs :

# SpeedTyping.Lobby.PlayerNamePlaceholder
source: Player name
es_es: Nombre del jugador
fr_fr: Nom du joueur

# SpeedTyping.Lobby.JoinLobby
source: Join lobby
es_es: Unirse a la sala
fr_fr: Rejoindre le lobby

# SpeedTyping.Lobby.StartGame
source: Start Speed Typing
es_es: Iniciar Speed Typing
fr_fr: Démarrer Speed Typing

# SpeedTyping.Lobby.GoToGame
source: Go to game
es_es: Ir al juego
fr_fr: Accéder au jeu

# SpeedTyping.Lobby.ViewRules
source: View rules
es_es: Ver reglas
fr_fr: Voir les règles

# SpeedTyping.Rules.Title
source: Speed Typing rules
es_es: Reglas de Speed Typing
fr_fr: Règles du Speed Typing

# SpeedTyping.Rules.Item1
source: Each player must type the displayed sentence as quickly as possible.
es_es: Cada jugador debe escribir la frase mostrada lo más rápido posible.
fr_fr: Chaque joueur doit taper la phrase affichée le plus rapidement possible.

# SpeedTyping.Rules.Item2
source: Accuracy matters: every character counts.
es_es: La precisión es clave: cada carácter cuenta.
fr_fr: La précision est essentielle : chaque caractère compte.

# SpeedTyping.Rules.Item3
source: The first player to finish with 100% accuracy wins the game.
es_es: El primer jugador en terminar con 100% de precisión gana la partida.
fr_fr: Le joueur qui termine avec 100% de précision gagne la partie.

# SpeedTyping.Rules.Item4
source: If time runs out, the player with the best score wins.
es_es: Si se acaba el tiempo, gana el jugador con mejor puntuación.
fr_fr: Si le temps imparti est écoulé, le joueur avec le meilleur score gagne.

# SpeedTyping.Rules.Item5
source: Good luck â€” may the best typist win!
es_es: ¡Suerte y que gane el mejor!
fr_fr: Bonne chance et que le meilleur gagne !

# SpeedTyping.Lobby.EnterPlayerNameAlert
source: Please enter a player name.
es_es: Por favor, introduce un nombre de jugador.
fr_fr: Veuillez entrer un nom de joueur.

# SpeedTyping.Lobby.JoinLobbyError
source: Unable to join the lobby. Please try again.
es_es: No se pudo unir a la sala. Inténtalo de nuevo.
fr_fr: Impossible de rejoindre le lobby. Veuillez réessayer.

# SpeedTyping.Lobby.StartGameError
source: Unable to start the game. Please try again.
es_es: No se pudo iniciar la partida. Inténtalo de nuevo.
fr_fr: Impossible de démarrer la partie. Veuillez réessayer.

# Puissance4.Game.Subtitle
source: Connect 4 tokens to win
es_es: Alinea 4 fichas para ganar
fr_fr: Alignez 4 jetons pour gagner

# Puissance4.Game.WaitingForStart
source: Waiting for the game to start...
es_es: Esperando a que empiece la partida...
fr_fr: En attente du démarrage de la partie...

# Puissance4.Game.Player1Default
source: Player 1
es_es: Jugador 1
fr_fr: Joueur 1

# Puissance4.Game.Player2Default
source: Player 2
es_es: Jugador 2
fr_fr: Joueur 2

# Puissance4.Game.Tie
source: It's a tie!
es_es: ¡Empate!
fr_fr: Match nul !

# Puissance4.Game.WinnerWon
source: {0} won!
es_es: ¡{0} ha ganado!
fr_fr: {0} a gagné !

# Puissance4.Game.CommunicationError
source: Communication error
es_es: Error de comunicación
fr_fr: Erreur de communication

# Puissance4.Game.YourTurn
source: It's your turn!
es_es: ¡Es tu turno!
fr_fr: C'est votre tour !

# Puissance4.Game.TurnOf
source: {0}'s turn
es_es: Turno de {0}
fr_fr: Tour de {0}

# Puissance4.Game.ConnectionError
source: Connection error
es_es: Error de conexión
fr_fr: Erreur de connexion

# SpeedTyping.Game.WinnerCongrats
source: Congratulations, {0}! You won!
es_es: ¡Enhorabuena, {0}! ¡Has ganado!
fr_fr: Félicitations, {0} ! Vous avez gagné !

# SpeedTyping.Game.PlayerLabel
source: Player
es_es: Jugador
fr_fr: Joueur

# SpeedTyping.Game.ProgressLabel
source: Progress
es_es: Progreso
fr_fr: Progression

# SpeedTyping.Game.TextToTypeTitle
source: Text to type
es_es: Frase para escribir
fr_fr: Phrase à taper

# SpeedTyping.Game.TypeAboveHint
source: Type the text above.
es_es: Escribe el texto de arriba.
fr_fr: Tapez le texte ci-dessus.

# SpeedTyping.Game.PlayersProgressTitle
source: Players progress
es_es: Progreso de los jugadores
fr_fr: Progression des joueurs

# SpeedTyping.Game.EndGameFailed
source: Unable to end the game. Please check your connection.
es_es: No se pudo finalizar la partida. Comprueba tu conexión.
fr_fr: Impossible de terminer la partie. Vérifiez votre connexion.

# Puissance4.Lobbies.Title
source: Connect Four Lobby
es_es: Sala de Conecta 4
fr_fr: Lobby Puissance 4

# Puissance4.Lobbies.Subtitle
source: Create or join a game
es_es: Crea o únete a una partida
fr_fr: Créez ou rejoignez une partie
